package com.example.myapp

object KikorikRepository {
    val list: List<Kikorik> = listOf(
        Kikorik(id = 1, main = true, name = "Совунья", description = "Cтарая и мудрая сова, которая одновременно и главная спортсменка, и главный врач страны смешариков.",
        url = "https://i.pinimg.com/originals/82/22/4f/82224f69c211273de2616dd6b69e8cc6.jpg"),
        Kikorik(id = 2, main = true, name = "Крош", description = "Весёлый и энергичный кролик мужского пола, который ведёт очень активный образ жизни и постоянно находится в движении. Он крайне оптимистичен и общителен, состоит в дружеских отношениях со сверстниками и с частью взрослого населения Ромашковой долины.",
            url = "https://tlum.ru/uploads/d6d38ebcf8548d81eb1f4dc3a54ed4d62f98301b8418d226ad19c2ccb440f412.jpeg"),
        Kikorik(id = 3, main = true, name = "Ёжик", description = "Застенчивый ёж мужского пола, живущий в стране смешариков. Любит коллекционировать кактусы и фантики от конфет. Его лучший друг — Крош.",
            url = "https://i.ytimg.com/vi/m4VFGJXr27g/maxresdefault.jpg"),
        Kikorik(id = 4, main = true, name = "Лосяш", description = "Интеллигентный лось-учёный. Интересуется многими науками: химией, астрономией, биологией, физикой и другими. Из-за сильной увлечённости Лосяша научной деятельностью в его доме царит беспорядок, да и вид его самого довольно неряшливый.",
            url = "https://ru.wikifur.com/w/images/2/26/Losyash.jpg"),
        Kikorik(id = 5, main = true, name = "Нюша", description = "Свинка-модница, по характеру она явный холерик. Любимая фраза: \"Ну вы совсем!\"",
            url = "https://kto-ozvuchil.ru/wp-content/uploads/03-10.jpg"),
        Kikorik(id = 190, main = true, name = "Бараш", description = "Сентиментальный меланхоличный баран-романтик и поэт-лирик. У Бараша голубые глаза и сиреневая, очень пушистая, приятная на ощупь шёрстка. Также Бараш имеет красивые нежно-фиолетовые витые рога и копытца.",
            url = "https://citaty.info/files/quote-pictures/423684-smeshariki_0.jpg"),
        Kikorik(id = 18, main = true, name = "Копатыч", description = "Добрый и хозяйственный медведь-огородник, который выращивает продукты для своих друзей. Он любит свой огород и трепетно за ним ухаживает: борется с некультурными растениями, стрижет газон и строит новые ульи своим пчёлам, чтобы они приносили больше его любимого меда. В свободное время Копатыч не прочь сходить на рыбалку, поболеть за свою футбольную команду (слушает радиорепортажи даже во время работы в саду) и попеть частушки под гармошку.",
            url = "https://cs13.pikabu.ru/post_img/big/2020/01/17/5/1579242654187294635.jpg"),
        Kikorik(id = 6, main = true, name = "Кар-Карыч", description = "Пожилой ворон. Самый артистичный среди главных героев. В молодости много путешествовал. Играет на рояле, виолончели и даёт уроки пения другим смешарикам.",
            url = "https://multsforkids.ru/data/uploads/personaji/kar-karich/kar-karich-kartinki-3.jpg"),
        Kikorik(id = 7, main = true, name = "Пин", description = "Изобретатель-самоучка. Виртуоз в своих железных изобретениях. Пин — иностранец, поэтому и говорит он с заметным немецким акцентом. Сдержан в эмоциях, он чопорен и щепетилен даже в мелочах и любит учиться на ошибках.",
            url = "https://ru.mdz-moskau.eu/wp-content/uploads/2022/08/orig-1-1024x576.jpg"),
        Kikorik(id = 1008, main = false, name = "Биби", description = "Маленький робот-смешарик, которого создал Пин. Очень любит учиться, летал на Луну, Сатурн, в Египет и другие места.",
            url = "https://smeshariki-mir.ru/wp-content/uploads/24325bd06b45951ac8bf145eeca4fdaa.jpg"),
        Kikorik(id = 8, main = false, name = "Бутерброд", description = "Вымышленный персонаж, галлюцинация Лосяша во время голодовки в серии «Бутерброд». Живёт в заброшенном доме.",
            url = "https://smeshariki-mir.ru/heroes2/ico/025.png"),
        Kikorik(id = 9, main = false, name = "Железная няня", description = "Робот, которого Пин создал по просьбе Кроша. Изначально няня была агрессивной и чересчур заботливой, но затем она предстаёт нам уже добрым роботом, частенько помогающим смешарикам.",
            url = "https://pm1.aminoapps.com/7772/1456c29d896e2ce0fd96e6bffe231d0ad03327f1r1-720-890v2_00.jpg"),
        Kikorik(id = 10, main = false, name = "Тигриция", description = "Символ 2010 года, актриса, очаровавшая большинство Смешариков. Работает у режиссёра Мышарика.",
            url = "https://slovnet.ru/wp-content/uploads/2019/04/2-28.jpg"),
        Kikorik(id = 11, main = false, name = "Чёрный ловелас", description = "Возможно, человек. Один из самых загадочных персонажей мультсериала.",
            url = "https://phonoteka.org/uploads/posts/2023-03/thumbs/1680078437_phonoteka-org-p-smeshariki-lovelas-art-vkontakte-6.jpg")
    )
}
